{
  "ir_version": 10,
  "opset_import": [
    {
      "domain": "ai.onnx.ml",
      "version": 1
    },
    {
      "domain": "",
      "version": 21
    }
  ],
  "producer_name": "skl2onnx",
  "producer_version": "1.18.0",
  "domain": "ai.onnx",
  "model_version": 0,
  "doc_string": "",
  "graph": {
    "node": [
      {
        "input": [
          "float_input"
        ],
        "output": [
          "variable"
        ],
        "name": "LinearRegressor",
        "op_type": "LinearRegressor",
        "domain": "ai.onnx.ml",
        "attribute": [
          {
            "name": "coefficients",
            "type": 6,
            "floats": [
              -0.1436043,
              -0.023200545,
              0.25180334,
              0.5896263
            ]
          },
          {
            "name": "intercepts",
            "type": 6,
            "floats": [
              0.26413974
            ]
          }
        ]
      }
    ],
    "name": "ca981c84777a400cb52a77a1dda45bb8",
    "input": [
      {
        "name": "float_input",
        "type": {
          "Value": {
            "TensorType": {
              "elem_type": 1,
              "shape": {
                "dim": [
                  {
                    "Value": null
                  },
                  {
                    "Value": {
                      "DimValue": 4
                    }
                  }
                ]
              }
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "variable",
        "type": {
          "Value": {
            "TensorType": {
              "elem_type": 1,
              "shape": {
                "dim": [
                  {
                    "Value": null
                  },
                  {
                    "Value": {
                      "DimValue": 1
                    }
                  }
                ]
              }
            }
          }
        }
      }
    ]
  }
}