{
  "ir_version": 10,
  "opset_import": [
    {
      "domain": "",
      "version": 9
    },
    {
      "domain": "ai.onnx.ml",
      "version": 1
    }
  ],
  "producer_name": "skl2onnx",
  "producer_version": "1.18.0",
  "domain": "ai.onnx",
  "model_version": 0,
  "doc_string": "",
  "graph": {
    "node": [
      {
        "input": [
          "float_input"
        ],
        "output": [
          "label",
          "probabilities"
        ],
        "name": "TreeEnsembleClassifier",
        "op_type": "TreeEnsembleClassifier",
        "domain": "ai.onnx.ml",
        "attribute": [
          {
            "name": "class_ids",
            "type": 7,
            "ints": [
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2,
              0,
              1,
              2
            ]
          },
          {
            "name": "class_nodeids",
            "type": 7,
            "ints": [
              2,
              2,
              2,
              4,
              4,
              4,
              5,
              5,
              5,
              7,
              7,
              7,
              12,
              12,
              12,
              13,
              13,
              13,
              14,
              14,
              14,
              15,
              15,
              15,
              18,
              18,
              18,
              19,
              19,
              19,
              20,
              20,
              20,
              2,
              2,
              2,
              4,
              4,
              4,
              5,
              5,
              5,
              9,
              9,
              9,
              10,
              10,
              10,
              12,
              12,
              12,
              13,
              13,
              13,
              16,
              16,
              16,
              18,
              18,
              18,
              19,
              19,
              19,
              20,
              20,
              20,
              1,
              1,
              1,
              4,
              4,
              4,
              6,
              6,
              6,
              7,
              7,
              7,
              10,
              10,
              10,
              11,
              11,
              11,
              12,
              12,
              12,
              1,
              1,
              1,
              4,
              4,
              4,
              5,
              5,
              5,
              9,
              9,
              9,
              11,
              11,
              11,
              13,
              13,
              13,
              15,
              15,
              15,
              16,
              16,
              16,
              17,
              17,
              17,
              18,
              18,
              18,
              1,
              1,
              1,
              4,
              4,
              4,
              6,
              6,
              6,
              8,
              8,
              8,
              10,
              10,
              10,
              11,
              11,
              11,
              12,
              12,
              12,
              2,
              2,
              2,
              3,
              3,
              3,
              5,
              5,
              5,
              10,
              10,
              10,
              11,
              11,
              11,
              12,
              12,
              12,
              13,
              13,
              13,
              16,
              16,
              16,
              17,
              17,
              17,
              18,
              18,
              18,
              1,
              1,
              1,
              5,
              5,
              5,
              6,
              6,
              6,
              8,
              8,
              8,
              10,
              10,
              10,
              11,
              11,
              11,
              14,
              14,
              14,
              16,
              16,
              16,
              17,
              17,
              17,
              18,
              18,
              18,
              1,
              1,
              1,
              4,
              4,
              4,
              6,
              6,
              6,
              7,
              7,
              7,
              8,
              8,
              8,
              2,
              2,
              2,
              5,
              5,
              5,
              6,
              6,
              6,
              7,
              7,
              7,
              10,
              10,
              10,
              11,
              11,
              11,
              12,
              12,
              12,
              2,
              2,
              2,
              5,
              5,
              5,
              6,
              6,
              6,
              8,
              8,
              8,
              9,
              9,
              9,
              10,
              10,
              10,
              1,
              1,
              1,
              4,
              4,
              4,
              5,
              5,
              5,
              8,
              8,
              8,
              9,
              9,
              9,
              10,
              10,
              10,
              1,
              1,
              1,
              5,
              5,
              5,
              7,
              7,
              7,
