{
  "ir_version": 10,
  "opset_import": [
    {
      "domain": "",
      "version": 9
    },
    {
      "domain": "ai.onnx.ml",
      "version": 1
    }
  ],
  "producer_name": "skl2onnx",
  "producer_version": "1.18.0",
  "domain": "ai.onnx",
  "model_version": 0,
  "doc_string": "",
  "graph": {
    "node": [
      {
        "input": [
          "float_input"
        ],
        "output": [
          "label",
          "SVM02"
        ],
        "name": "SVMc",
        "op_type": "SVMClassifier",
        "domain": "ai.onnx.ml",
        "attribute": [
          {
            "name": "classlabels_ints",
            "type": 7,
            "ints": [
              0,
              1,
              2
            ]
          },
          {
            "name": "coefficients",
            "type": 6,
            "floats": [
              1,
              1,
              0.21150874,
              1,
              1,
              -0,
              -0,
              -0,
              -0,
              -0.21150874,
              -0,
              -0,
              -0,
              -1,
              -0,
              -0,
              -1,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -1,
              -0,
              -0,
              -0,
              -1,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0.30383983,
              -0,
              -0.699073,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -0,
              -1,
              1,
              0.22251512,
              0,
              0.40995413,
              0.37044358,
              1,
              1,
              1,
              1,
              0,
              1,
              0.24767993,
              1,
              0,
              1,
              1,
              0,
              1,
              1,
              1,
              1,
              1,
              1,
              0,
              1,
              1,
              1,
              0,
              1,
              1,
              -1,
              -1,
              -1,
              -1,
              -0,
              -1,
              -1,
              -1,
              -1,
              -0.28380156,
              -1,
              -1,
              -1,
              -0.9638784,
              -1,
              -1,
              -1,
              -1,
              -1,
              -1,
              -1
            ]
          },
          {
            "name": "kernel_params",
            "type": 6,
            "floats": [
              0.06514191,
              0,
              3
            ]
          },
          {
            "name": "kernel_type",
            "type": 3,
            "s": "UkJG"
          },
          {
            "name": "post_transform",
            "type": 3,
            "s": "Tk9ORQ=="
          },
          {
            "name": "prob_a",
            "type": 6,
            "floats": [
              -3.2571776,
              -3.3157504,
              -3.655112
            ]
          },
          {
            "name": "prob_b",
            "type": 6,
            "floats": [
              0.12116865,
              0.033765092,
              0.054304965
            ]
          },
          {
            "name": "rho",
            "type": 6,
            "floats": [
              0.16605824,
              -0.075044796,
              -0.12782638
            ]
          },
          {
            "name": "support_vectors",
            "type": 6,
            "floats": [
              5.1,
              3.8,
              1.9,
              0.4,
              4.8,
              3.4,
              1.9,
              0.2,
              5,
              3,
              1.6,
              0.2,
              5.1,
              3.3,
              1.7,
              0.5,
              4.5,
              2.3,
              1.3,
              0.3,
              6,
              3.4,
              4.5,
              1.6,
              6.7,
              3.1,
              4.7,
              1.5,
              6.6,
              3,
              4.4,
              1.4,
              5.6,
              3,
              4.5,
              1.5,
              5,
              2,
              3.5,
              1,
              5.6,
              2.7,
              4.2,
              1.3,
              6.2,
              2.9,
              4.3,
              1.3,
              5.4,
              3,
              4.5,
              1.5,
              5,
              2.3,
              3.3,
              1,
              6.7,
              3,
              5,
              1.7,
              5.9,
              3.2,
              4.8,
              1.8,
              5.1,
              2.5,
              3,
              1.1,
              6,
              2.7,
              5.1,
              1.6,
              6.3,
              2.5,
              4.9,
              1.5,
              6.1,
              2.9,
              4.7,
              1.4,
              6.5,
              2.8,
              4.6,
              1.5,
              7,
              3.2,
              4.7,
              1.4,
              5.9,
              3,
              4.2,
              1.5,
              5.7,
              2.6,
              3.5,
              1,
              6.1,
              3,
              4.6,
              1.4,
              6.6,
              2.9,
              4.6,
              1.3,
              5.5,
              2.6,
              4.4,
              1.2,
              4.9,
              2.4,
              3.3,
              1,
              6.9,
              3.1,
              4.9,
              1.5,
              6.3,
              2.3,
              4.4,
              1.3,
              5.8,
              2.7,
              5.1,
              1.9,
              6.3,
              2.8,
              5.1,
              1.5,
              6.4,
              3.1,
              5.5,
              1.8,
              6.3,
              2.7,
              4.9,
              1.8,
              7.7,
              3.8,
              6.7,
              2.2,
              5.7,
              2.5,
              5,
              2,
              6,
              3,
              4.8,
              1.8,
              5.8,
              2.7,
              5.1,
              1.9,
              6.4,
              2.7,
              5.3,
              1.9,
              5.8,
              2.8,
              5.1,
              2.4,
              6.1,
              2.6,
              5.6,
              1.4,
              6,
              2.2,
              5,
              1.5,
              6.2,
              2.8,
              4.8,
              1.8,
              6.4,
              3.2,
              5.3,
              2.3,
              6.9,
              3.1,
              5.4,
              2.1,
              6.5,
              3,
              5.2,
              2,
              7.2,
              3,
              5.8,
              1.6,
              6.5,
              3,
              5.5,
              1.8,
              5.6,
              2.8,
              4.9,
              2,
              5.9,
              3,
              5.1,
              1.8,
              4.9,
              2.5,
              4.5,
              1.7
            ]
          },
          {
            "name": "vectors_per_class",
            "type": 7,
            "ints": [
              5,
              25,
              21
            ]
          }
        ]
      },
      {
        "input": [
          "SVM02"
        ],
        "output": [
          "probabilities"
        ],
        "name": "Cast",
        "op_type": "Cast",
        "domain": "",
        "attribute": [
          {
            "name": "to",
            "type": 2,
            "i": 1
          }
        ]
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast1",
        "op_type": "Cast",
        "domain": "",
        "attribute": [
          {
            "name": "to",
            "type": 2,
            "i": 7
          }
        ]
      },
      {
        "input": [
          "probabilities"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "op_type": "ZipMap",
        "domain": "ai.onnx.ml",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "type": 7,
            "ints": [
              0,
              1,
              2
            ]
          }
        ]
      }
    ],
    "name": "f5e96ee7ca47429093e7a57b00cfa57b",
    "input": [
      {
        "name": "float_input",
        "type": {
          "Value": {
            "TensorType": {
              "elem_type": 1,
              "shape": {
                "dim": [
                  {
                    "Value": null
                  },
                  {
                    "Value": {
                      "DimValue": 4
                    }
                  }
                ]
              }
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "output_label",
        "type": {
          "Value": {
            "TensorType": {
              "elem_type": 7,
              "shape": {
                "dim": [
                  {
                    "Value": null
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "output_probability",
        "type": {
          "Value": {
            "SequenceType": {
              "elem_type": {
                "Value": {
                  "MapType": {
                    "key_type": 7,
                    "value_type": {
                      "Value": {
                        "TensorType": {
                          "elem_type": 1
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    ]
  }
}