{
  "irVersion": 10,
  "opsetImport": [
    {
      "domain": "ai.onnx.ml",
      "version": 1
    },
    {
      "domain": "",
      "version": 21
    }
  ],
  "producerName": "skl2onnx",
  "producerVersion": "1.18.0",
  "domain": "ai.onnx",
  "modelVersion": 0,
  "docString": "",
  "graph": {
    "node": [
      {
        "input": ["float_input"],
        "output": ["variable"],
        "name": "LinearRegressor",
        "opType": "LinearRegressor",
        "domain": "ai.onnx.ml",
        "attribute": [
          {
            "name": "coefficients",
            "type": 6,
            "floats": [-0.1436043, -0.023200545, 0.25180334, 0.5896263]
          },
          {
            "name": "intercepts",
            "type": 6,
            "floats": [0.26413974]
          }
        ]
      }
    ],
    "name": "graph_valid",
    "input": [
      {
        "name": "float_input",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [{}, { "dimValue": 4 }]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "variable",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [{}, { "dimValue": 1 }]
            }
          }
        }
      }
    ]
  }
}
